lambda/src/test/resources/Migrations/SupporterPlus2023V1V2/z-monthly-extra-case-1/subscription.json

{
  "success" : true,
  "id" : "SUBSCRIPTION-ID",
  "accountId" : "ACCOUNT-ID",
  "accountNumber" : "ACCOUNT-NUMBER",
  "accountName" : "0010J00001qxpcAQAQ",
  "invoiceOwnerAccountId" : "ACCOUNT-ID",
  "invoiceOwnerAccountNumber" : "ACCOUNT-NUMBER",
  "invoiceOwnerAccountName" : "0010J00001qxpcAQAQ",
  "subscriptionNumber" : "SUBSCRIPTION-NUMBER",
  "version" : 8,
  "revision" : "8.0",
  "termType" : "TERMED",
  "invoiceSeparately" : false,
  "contractEffectiveDate" : "2018-02-20",
  "serviceActivationDate" : "2018-02-20",
  "customerAcceptanceDate" : "2018-02-20",
  "subscriptionStartDate" : "2018-02-20",
  "subscriptionEndDate" : "2024-02-20",
  "lastBookingDate" : "2023-05-08",
  "termStartDate" : "2023-02-20",
  "termEndDate" : "2024-02-20",
  "initialTerm" : 12,
  "initialTermPeriodType" : "Month",
  "currentTerm" : 12,
  "currentTermPeriodType" : "Month",
  "autoRenew" : true,
  "renewalSetting" : "RENEW_WITH_SPECIFIC_TERM",
  "renewalTerm" : 12,
  "renewalTermPeriodType" : "Month",
  "contractedMrr" : 10.00,
  "totalContractedValue" : 407.14,
  "notes" : null,
  "status" : "Active",
  "TrialPeriodPrice__c" : null,
  "CanadaHandDelivery__c" : null,
  "QuoteNumber__QT" : null,
  "GifteeIdentityId__c" : null,
  "OpportunityName__QT" : null,
  "GiftNotificationEmailDate__c" : null,
  "Gift_Subscription__c" : "No",
  "TrialPeriodDays__c" : null,
  "CreatedRequestId__c" : null,
  "AcquisitionSource__c" : null,
  "CreatedByCSR__c" : null,
  "CASSubscriberID__c" : null,
  "LastPriceChangeDate__c" : null,
  "InitialPromotionCode__c" : null,
  "CpqBundleJsonId__QT" : null,
  "RedemptionCode__c" : null,
  "QuoteType__QT" : null,
  "GiftRedemptionDate__c" : null,
  "QuoteBusinessType__QT" : null,
  "SupplierCode__c" : null,
  "legacy_cat__c" : null,
  "AcquisitionCase__c" : null,
  "ReaderType__c" : null,
  "ActivationDate__c" : null,
  "UserCancellationReason__c" : null,
  "OpportunityCloseDate__QT" : null,
  "IPaddress__c" : null,
  "IPCountry__c" : null,
  "PromotionCode__c" : null,
  "OriginalSubscriptionStartDate__c" : null,
  "LegacyContractStartDate__c" : null,
  "CancellationReason__c" : null,
  "billToContact" : null,
  "paymentTerm" : null,
  "invoiceTemplateId" : null,
  "invoiceTemplateName" : null,
  "sequenceSetId" : null,
  "sequenceSetName" : null,
  "soldToContact" : null,
  "isLatestVersion" : true,
  "cancelReason" : null,
  "ratePlans" : [ {
    "id" : "8a12886a87fb2fba0187fc06f36577ee",
    "lastChangeType" : "Remove",
    "productId" : "2c92a0fe5aacfabe015ad24bf6e15ff6",
    "productName" : "Contributor",
    "productSku" : "ABC-00000028",
    "productRatePlanId" : "2c92a0fc5aacfadd015ad24db4ff5e97",
    "productRatePlanNumber" : null,
    "ratePlanName" : "Monthly Contribution",
    "subscriptionProductFeatures" : [ ],
    "externallyManagedPlanId" : null,
    "subscriptionRatePlanNumber" : null,
    "ratePlanCharges" : [ {
      "id" : "8a12886a87fb2fba0187fc06f36577ef",
      "originalChargeId" : "2c92a0fd61b08db60161b28c0eb248cf",
      "productRatePlanChargeId" : "2c92a0fc5aacfadd015ad250bf2c6d38",
      "number" : "C-01249312",
      "name" : "Monthly Contribution",
      "productRatePlanChargeNumber" : null,
      "type" : "Recurring",
      "model" : "FlatFee",
      "uom" : null,
      "version" : 7,
      "pricingSummary" : "GBP5",
      "priceChangeOption" : "NoChange",
      "priceIncreasePercentage" : null,
      "currency" : "GBP",
      "price" : 5.000000000,
      "tiers" : null,
      "chargeModelConfiguration" : null,
      "inputArgumentId" : null,
      "includedUnits" : null,
      "overagePrice" : null,
      "discountPercentage" : null,
      "discountAmount" : null,
      "applyDiscountTo" : null,
      "discountLevel" : null,
      "discountClass" : null,
      "discountApplyDetails" : null,
      "billingDay" : "ChargeTriggerDay",
      "listPriceBase" : "Per_Billing_Period",
      "billingPeriod" : "Month",
      "specificBillingPeriod" : null,
      "billingTiming" : "IN_ADVANCE",
      "ratingGroup" : null,
      "billingPeriodAlignment" : "AlignToCharge",
      "quantity" : 1.000000000,
      "smoothingModel" : null,
      "numberOfPeriods" : null,
      "overageCalculationOption" : null,
      "overageUnusedUnitsCreditOption" : null,
      "unusedUnitsCreditRates" : null,
      "usageRecordRatingOption" : null,
      "segment" : 1,
      "effectiveStartDate" : "2018-02-20",
      "effectiveEndDate" : "2023-05-08",
      "processedThroughDate" : "2023-05-08",
      "chargedThroughDate" : "2023-05-08",
      "done" : true,
      "triggerDate" : null,
      "triggerEvent" : "CustomerAcceptance",
      "endDateCondition" : "Subscription_End",
      "upToPeriodsType" : null,
      "upToPeriods" : null,
      "specificEndDate" : null,
      "mrr" : 5.000000000,
      "dmrc" : 0.000000000,
      "tcv" : 313.000000000,
      "dtcv" : -47.000000000,
      "originalOrderDate" : "2018-02-20",
      "amendedByOrderOn" : "2023-05-08",
      "description" : "",
      "HolidayStart__c" : null,
      "HolidayEnd__c" : null,
      "ForceSync__c" : null
    } ]
  }, {
    "id" : "8a12886a87fb2fba0187fc06f39d77f7",
    "lastChangeType" : "Add",
    "productId" : "8a12865b8219d9b4018221061563643f",
    "productName" : "Supporter Plus",
    "productSku" : "ABC-00000032",
    "productRatePlanId" : "8a12865b8219d9b401822106192b64dc",
    "productRatePlanNumber" : null,
    "ratePlanName" : "Supporter Plus Monthly",
    "subscriptionProductFeatures" : [ ],
    "externallyManagedPlanId" : null,
    "subscriptionRatePlanNumber" : null,
    "ratePlanCharges" : [ {
      "id" : "8a12886a87fb2fba0187fc06f39f77f9",
      "originalChargeId" : "8a12886a87fb2fba0187fc06f22577d8",
      "productRatePlanChargeId" : "8a12865b8219d9b401822106194e64e3",
      "number" : "C-04311965",
      "name" : "Supporter Plus Monthly Charge",
      "productRatePlanChargeNumber" : null,
      "type" : "Recurring",
      "model" : "FlatFee",
      "uom" : null,
      "version" : 1,
      "pricingSummary" : "GBP10",
      "priceChangeOption" : "NoChange",
      "priceIncreasePercentage" : null,
      "currency" : "GBP",
      "price" : 10.000000000,
      "tiers" : null,
      "chargeModelConfiguration" : null,
      "inputArgumentId" : null,
      "includedUnits" : null,
      "overagePrice" : null,
      "discountPercentage" : null,
      "discountAmount" : null,
      "applyDiscountTo" : null,
      "discountLevel" : null,
      "discountClass" : null,
      "discountApplyDetails" : null,
      "billingDay" : "ChargeTriggerDay",
      "listPriceBase" : "Per_Billing_Period",
      "billingPeriod" : "Month",
      "specificBillingPeriod" : null,
      "billingTiming" : "IN_ADVANCE",
      "ratingGroup" : null,
      "billingPeriodAlignment" : "AlignToCharge",
      "quantity" : 1.000000000,
      "smoothingModel" : null,
      "numberOfPeriods" : null,
      "overageCalculationOption" : null,
      "overageUnusedUnitsCreditOption" : null,
      "unusedUnitsCreditRates" : null,
      "usageRecordRatingOption" : null,
      "segment" : 1,
      "effectiveStartDate" : "2023-05-08",
      "effectiveEndDate" : "2024-02-20",
      "processedThroughDate" : "2023-07-08",
      "chargedThroughDate" : "2023-08-08",
      "done" : false,
      "triggerDate" : null,
      "triggerEvent" : "CustomerAcceptance",
      "endDateCondition" : "Subscription_End",
      "upToPeriodsType" : null,
      "upToPeriods" : null,
      "specificEndDate" : null,
      "mrr" : 10.000000000,
      "dmrc" : 10.000000000,
      "tcv" : 94.137931030,
      "dtcv" : 94.137931030,
      "originalOrderDate" : "2023-05-08",
      "amendedByOrderOn" : null,
      "description" : "",
      "HolidayStart__c" : null,
      "HolidayEnd__c" : null,
      "ForceSync__c" : null
    } ]
  } ],
  "orderNumber" : "O-00614917",
  "externallyManagedBy" : null,
  "statusHistory" : [ {
    "startDate" : "2018-02-20",
    "endDate" : "2024-02-20",
    "status" : "Active"
  }, {
    "startDate" : "2024-02-20",
    "endDate" : null,
    "status" : "OutOfTerm"
  } ]
}