lambda/src/test/resources/SupporterPlus2023V1V2/annual-contribution/subscription.json

{
  "success" : true,
  "id" : "8a12873f89548834018958ae04a52978",
  "accountId" : "8a12873f89548834018958ae044c2954",
  "accountNumber" : "A01849400",
  "accountName" : "0015I00000jOTrtQAG",
  "invoiceOwnerAccountId" : "8a12873f89548834018958ae044c2954",
  "invoiceOwnerAccountNumber" : "A01849400",
  "invoiceOwnerAccountName" : "0015I00000jOTrtQAG",
  "subscriptionNumber" : "SUBSCRIPTION-NUMBER",
  "version" : 1,
  "revision" : "1.0",
  "termType" : "TERMED",
  "invoiceSeparately" : false,
  "contractEffectiveDate" : "2023-07-15",
  "serviceActivationDate" : "2023-07-15",
  "customerAcceptanceDate" : "2023-07-15",
  "subscriptionStartDate" : "2023-07-15",
  "subscriptionEndDate" : "2024-07-15",
  "lastBookingDate" : "2023-07-15",
  "termStartDate" : "2023-07-15",
  "termEndDate" : "2024-07-15",
  "initialTerm" : 12,
  "initialTermPeriodType" : "Month",
  "currentTerm" : 12,
  "currentTermPeriodType" : "Month",
  "autoRenew" : true,
  "renewalSetting" : "RENEW_WITH_SPECIFIC_TERM",
  "renewalTerm" : 12,
  "renewalTermPeriodType" : "Month",
  "contractedMrr" : 10.00,
  "totalContractedValue" : 120.00,
  "notes" : null,
  "status" : "Active",
  "TrialPeriodPrice__c" : null,
  "CanadaHandDelivery__c" : null,
  "QuoteNumber__QT" : null,
  "GifteeIdentityId__c" : null,
  "OpportunityName__QT" : null,
  "GiftNotificationEmailDate__c" : null,
  "Gift_Subscription__c" : "No",
  "TrialPeriodDays__c" : null,
  "CreatedRequestId__c" : "6dc651e4-9ca4-d64c-0000-000000030ab6",
  "AcquisitionSource__c" : null,
  "CreatedByCSR__c" : null,
  "CASSubscriberID__c" : null,
  "LastPriceChangeDate__c" : null,
  "InitialPromotionCode__c" : null,
  "CpqBundleJsonId__QT" : null,
  "RedemptionCode__c" : null,
  "QuoteType__QT" : null,
  "GiftRedemptionDate__c" : null,
  "QuoteBusinessType__QT" : null,
  "SupplierCode__c" : null,
  "legacy_cat__c" : null,
  "AcquisitionCase__c" : null,
  "ReaderType__c" : "Direct",
  "ActivationDate__c" : null,
  "UserCancellationReason__c" : null,
  "OpportunityCloseDate__QT" : null,
  "IPaddress__c" : null,
  "IPCountry__c" : null,
  "PromotionCode__c" : null,
  "OriginalSubscriptionStartDate__c" : null,
  "LegacyContractStartDate__c" : null,
  "CancellationReason__c" : null,
  "billToContact" : null,
  "paymentTerm" : null,
  "invoiceTemplateId" : null,
  "invoiceTemplateName" : null,
  "sequenceSetId" : null,
  "sequenceSetName" : null,
  "soldToContact" : null,
  "isLatestVersion" : true,
  "cancelReason" : null,
  "ratePlans" : [ {
    "id" : "8a12873f89548834018958ae04d62981",
    "productId" : "8a12865b8219d9b4018221061563643f",
    "productName" : "Supporter Plus",
    "productSku" : "ABC-00000032",
    "productRatePlanId" : "8a128ed885fc6ded01860228f77e3d5a",
    "productRatePlanNumber" : null,
    "ratePlanName" : "Supporter Plus V2 - Annual",
    "subscriptionProductFeatures" : [ ],
    "externallyManagedPlanId" : null,
    "subscriptionRatePlanNumber" : "SRP-04439805",
    "ratePlanCharges" : [ {
      "id" : "8a12873f89548834018958ae04e92983",
      "originalChargeId" : "8a12873f89548834018958ae04e92983",
      "productRatePlanChargeId" : "8a128ed885fc6ded01860228f7cb3d5f",
      "number" : "C-04439843",
      "name" : "Supporter Plus Annual Charge",
      "productRatePlanChargeNumber" : null,
      "type" : "Recurring",
      "model" : "FlatFee",
      "uom" : null,
      "version" : 1,
      "pricingSummary" : "EUR95",
      "priceChangeOption" : "NoChange",
      "priceIncreasePercentage" : null,
      "currency" : "EUR",
      "price" : 95.000000000,
      "tiers" : null,
      "chargeModelConfiguration" : null,
      "inputArgumentId" : null,
      "includedUnits" : null,
      "overagePrice" : null,
      "discountPercentage" : null,
      "discountAmount" : null,
      "applyDiscountTo" : null,
      "discountLevel" : null,
      "discountClass" : null,
      "discountApplyDetails" : null,
      "billingDay" : "ChargeTriggerDay",
      "listPriceBase" : "Per_Billing_Period",
      "billingPeriod" : "Annual",
      "specificBillingPeriod" : null,
      "billingTiming" : "IN_ADVANCE",
      "ratingGroup" : null,
      "billingPeriodAlignment" : "AlignToTermStart",
      "quantity" : 1.000000000,
      "smoothingModel" : null,
      "numberOfPeriods" : null,
      "overageCalculationOption" : null,
      "overageUnusedUnitsCreditOption" : null,
      "unusedUnitsCreditRates" : null,
      "usageRecordRatingOption" : null,
      "segment" : 1,
      "effectiveStartDate" : "2023-07-15",
      "effectiveEndDate" : "2024-07-15",
      "processedThroughDate" : "2023-07-15",
      "chargedThroughDate" : "2024-07-15",
      "done" : false,
      "triggerDate" : null,
      "triggerEvent" : "CustomerAcceptance",
      "endDateCondition" : "Subscription_End",
      "upToPeriodsType" : null,
      "upToPeriods" : null,
      "specificEndDate" : null,
      "mrr" : 7.916666667,
      "dmrc" : 7.916666667,
      "tcv" : 95.000000000,
      "dtcv" : 95.000000000,
      "originalOrderDate" : "2023-07-15",
      "amendedByOrderOn" : null,
      "description" : "",
      "HolidayStart__c" : null,
      "HolidayEnd__c" : null,
      "ForceSync__c" : null
    }, {
      "id" : "8a12873f89548834018958ae04df2982",
      "originalChargeId" : "8a12873f89548834018958ae04df2982",
      "productRatePlanChargeId" : "8a12892d85fc6df4018602451322287f",
      "number" : "C-04439842",
      "name" : "Contribution",
      "productRatePlanChargeNumber" : null,
      "type" : "Recurring",
      "model" : "FlatFee",
      "uom" : null,
      "version" : 1,
      "pricingSummary" : "EUR25",
      "priceChangeOption" : "NoChange",
      "priceIncreasePercentage" : null,
      "currency" : "EUR",
      "price" : 25.000000000,
      "tiers" : null,
      "chargeModelConfiguration" : null,
      "inputArgumentId" : null,
      "includedUnits" : null,
      "overagePrice" : null,
      "discountPercentage" : null,
      "discountAmount" : null,
      "applyDiscountTo" : null,
      "discountLevel" : null,
      "discountClass" : null,
      "discountApplyDetails" : null,
      "billingDay" : "ChargeTriggerDay",
      "listPriceBase" : "Per_Billing_Period",
      "billingPeriod" : "Annual",
      "specificBillingPeriod" : null,
      "billingTiming" : "IN_ADVANCE",
      "ratingGroup" : null,
      "billingPeriodAlignment" : "AlignToCharge",
      "quantity" : 1.000000000,
      "smoothingModel" : null,
      "numberOfPeriods" : null,
      "overageCalculationOption" : null,
      "overageUnusedUnitsCreditOption" : null,
      "unusedUnitsCreditRates" : null,
      "usageRecordRatingOption" : null,
      "segment" : 1,
      "effectiveStartDate" : "2023-07-15",
      "effectiveEndDate" : "2024-07-15",
      "processedThroughDate" : "2023-07-15",
      "chargedThroughDate" : "2024-07-15",
      "done" : false,
      "triggerDate" : null,
      "triggerEvent" : "ContractEffective",
      "endDateCondition" : "Subscription_End",
      "upToPeriodsType" : null,
      "upToPeriods" : null,
      "specificEndDate" : null,
      "mrr" : 2.083333333,
      "dmrc" : 2.083333333,
      "tcv" : 25.000000000,
      "dtcv" : 25.000000000,
      "originalOrderDate" : "2023-07-15",
      "amendedByOrderOn" : null,
      "description" : "",
      "HolidayStart__c" : null,
      "HolidayEnd__c" : null,
      "ForceSync__c" : null
    } ]
  } ],
  "externallyManagedBy" : null,
  "statusHistory" : [ {
    "startDate" : "2023-07-15",
    "endDate" : "2024-07-15",
    "status" : "Active"
  }, {
    "startDate" : "2024-07-15",
    "endDate" : null,
    "status" : "OutOfTerm"
  } ]
}