lambda/src/test/resources/SupporterPlus2023V1V2/monthly-contribution/subscription.json

{
  "success" : true,
  "id" : "SUBSCRIPTION-ID",
  "accountId" : "ACCOUNT-ID",
  "accountNumber" : "ACCOUNT-NUMBER",
  "accountName" : "ACCOUNT-NAME",
  "invoiceOwnerAccountId" : "ACCOUNT-ID",
  "invoiceOwnerAccountNumber" : "ACCOUNT-NUMBER",
  "invoiceOwnerAccountName" : "ACCOUNT-NAME",
  "subscriptionNumber" : "SUBSCRIPTION-NUMBER",
  "version" : 1,
  "revision" : "1.0",
  "termType" : "TERMED",
  "invoiceSeparately" : false,
  "contractEffectiveDate" : "2023-07-03",
  "serviceActivationDate" : "2023-07-03",
  "customerAcceptanceDate" : "2023-07-03",
  "subscriptionStartDate" : "2023-07-03",
  "subscriptionEndDate" : "2024-07-03",
  "lastBookingDate" : "2023-07-03",
  "termStartDate" : "2023-07-03",
  "termEndDate" : "2024-07-03",
  "initialTerm" : 12,
  "initialTermPeriodType" : "Month",
  "currentTerm" : 12,
  "currentTermPeriodType" : "Month",
  "autoRenew" : true,
  "renewalSetting" : "RENEW_WITH_SPECIFIC_TERM",
  "renewalTerm" : 12,
  "renewalTermPeriodType" : "Month",
  "contractedMrr" : 25.00,
  "totalContractedValue" : 300.00,
  "notes" : null,
  "status" : "Active",
  "TrialPeriodPrice__c" : null,
  "CanadaHandDelivery__c" : null,
  "QuoteNumber__QT" : null,
  "GifteeIdentityId__c" : null,
  "OpportunityName__QT" : null,
  "GiftNotificationEmailDate__c" : null,
  "Gift_Subscription__c" : "No",
  "TrialPeriodDays__c" : null,
  "CreatedRequestId__c" : "01f7af8b-c0c7-cb9d-0000-000000003323",
  "AcquisitionSource__c" : null,
  "CreatedByCSR__c" : null,
  "CASSubscriberID__c" : null,
  "LastPriceChangeDate__c" : null,
  "InitialPromotionCode__c" : null,
  "CpqBundleJsonId__QT" : null,
  "RedemptionCode__c" : null,
  "QuoteType__QT" : null,
  "GiftRedemptionDate__c" : null,
  "QuoteBusinessType__QT" : null,
  "SupplierCode__c" : null,
  "legacy_cat__c" : null,
  "AcquisitionCase__c" : null,
  "ReaderType__c" : "Direct",
  "ActivationDate__c" : null,
  "UserCancellationReason__c" : null,
  "OpportunityCloseDate__QT" : null,
  "IPaddress__c" : null,
  "IPCountry__c" : null,
  "PromotionCode__c" : null,
  "OriginalSubscriptionStartDate__c" : null,
  "LegacyContractStartDate__c" : null,
  "CancellationReason__c" : null,
  "billToContact" : null,
  "paymentTerm" : null,
  "invoiceTemplateId" : null,
  "invoiceTemplateName" : null,
  "sequenceSetId" : null,
  "sequenceSetName" : null,
  "soldToContact" : null,
  "isLatestVersion" : true,
  "cancelReason" : null,
  "ratePlans" : [ {
    "id" : "8a12921d89018aaa01891bef52021b65",
    "productId" : "8a12865b8219d9b4018221061563643f",
    "productName" : "Supporter Plus",
    "productSku" : "ABC-00000032",
    "productRatePlanId" : "8a12865b8219d9b401822106192b64dc",
    "productRatePlanNumber" : null,
    "ratePlanName" : "Supporter Plus Monthly",
    "subscriptionProductFeatures" : [ ],
    "externallyManagedPlanId" : null,
    "subscriptionRatePlanNumber" : null,
    "ratePlanCharges" : [ {
      "id" : "8a12921d89018aaa01891bef520e1b66",
      "originalChargeId" : "8a12921d89018aaa01891bef520e1b66",
      "productRatePlanChargeId" : "8a12865b8219d9b401822106194e64e3",
      "number" : "C-04419773",
      "name" : "Supporter Plus Monthly Charge",
      "productRatePlanChargeNumber" : null,
      "type" : "Recurring",
      "model" : "FlatFee",
      "uom" : null,
      "version" : 1,
      "pricingSummary" : "GBP25",
      "priceChangeOption" : "NoChange",
      "priceIncreasePercentage" : null,
      "currency" : "GBP",
      "price" : 25.000000000,
      "tiers" : null,
      "chargeModelConfiguration" : null,
      "inputArgumentId" : null,
      "includedUnits" : null,
      "overagePrice" : null,
      "discountPercentage" : null,
      "discountAmount" : null,
      "applyDiscountTo" : null,
      "discountLevel" : null,
      "discountClass" : null,
      "discountApplyDetails" : null,
      "billingDay" : "ChargeTriggerDay",
      "listPriceBase" : "Per_Billing_Period",
      "billingPeriod" : "Month",
      "specificBillingPeriod" : null,
      "billingTiming" : "IN_ADVANCE",
      "ratingGroup" : null,
      "billingPeriodAlignment" : "AlignToCharge",
      "quantity" : 1.000000000,
      "smoothingModel" : null,
      "numberOfPeriods" : null,
      "overageCalculationOption" : null,
      "overageUnusedUnitsCreditOption" : null,
      "unusedUnitsCreditRates" : null,
      "usageRecordRatingOption" : null,
      "segment" : 1,
      "effectiveStartDate" : "2023-07-03",
      "effectiveEndDate" : "2024-07-03",
      "processedThroughDate" : "2023-07-03",
      "chargedThroughDate" : "2023-08-03",
      "done" : false,
      "triggerDate" : null,
      "triggerEvent" : "CustomerAcceptance",
      "endDateCondition" : "Subscription_End",
      "upToPeriodsType" : null,
      "upToPeriods" : null,
      "specificEndDate" : null,
      "mrr" : 25.000000000,
      "dmrc" : 25.000000000,
      "tcv" : 300.000000000,
      "dtcv" : 300.000000000,
      "originalOrderDate" : "2023-07-03",
      "amendedByOrderOn" : null,
      "description" : "",
      "HolidayStart__c" : null,
      "HolidayEnd__c" : null,
      "ForceSync__c" : null
    } ]
  } ],
  "externallyManagedBy" : null,
  "statusHistory" : [ {
    "startDate" : "2023-07-03",
    "endDate" : "2024-07-03",
    "status" : "Active"
  }, {
    "startDate" : "2024-07-03",
    "endDate" : null,
    "status" : "OutOfTerm"
  } ]
}