lambda/src/test/resources/SupporterPlus2023V1V2/monthly-standard/subscription.json

{
  "success" : true,
  "id" : "SUBSCRIPTION-ID",
  "accountId" : "ACCOUNT-ID",
  "accountNumber" : "ACCOUNT-NUMBER",
  "accountName" : "0010J00001w3XTWQA2",
  "invoiceOwnerAccountId" : "ACCOUNT-ID",
  "invoiceOwnerAccountNumber" : "ACCOUNT-NUMBER",
  "invoiceOwnerAccountName" : "0010J00001w3XTWQA2",
  "subscriptionNumber" : "SUBSCRIPTION-NUMBER",
  "version" : 8,
  "revision" : "8.0",
  "termType" : "TERMED",
  "invoiceSeparately" : false,
  "contractEffectiveDate" : "2018-07-18",
  "serviceActivationDate" : "2018-07-18",
  "customerAcceptanceDate" : "2018-07-18",
  "subscriptionStartDate" : "2018-07-18",
  "subscriptionEndDate" : "2024-07-18",
  "lastBookingDate" : "2023-07-18",
  "termStartDate" : "2023-07-18",
  "termEndDate" : "2024-07-18",
  "initialTerm" : 12,
  "initialTermPeriodType" : "Month",
  "currentTerm" : 12,
  "currentTermPeriodType" : "Month",
  "autoRenew" : true,
  "renewalSetting" : "RENEW_WITH_SPECIFIC_TERM",
  "renewalTerm" : 12,
  "renewalTermPeriodType" : "Month",
  "contractedMrr" : 10.00,
  "totalContractedValue" : 720.00,
  "notes" : null,
  "status" : "Active",
  "TrialPeriodPrice__c" : null,
  "CanadaHandDelivery__c" : null,
  "QuoteNumber__QT" : null,
  "GifteeIdentityId__c" : null,
  "OpportunityName__QT" : null,
  "GiftNotificationEmailDate__c" : null,
  "Gift_Subscription__c" : "No",
  "TrialPeriodDays__c" : null,
  "CreatedRequestId__c" : null,
  "AcquisitionSource__c" : null,
  "CreatedByCSR__c" : null,
  "CASSubscriberID__c" : null,
  "LastPriceChangeDate__c" : null,
  "InitialPromotionCode__c" : null,
  "CpqBundleJsonId__QT" : null,
  "RedemptionCode__c" : null,
  "QuoteType__QT" : null,
  "GiftRedemptionDate__c" : null,
  "QuoteBusinessType__QT" : null,
  "SupplierCode__c" : null,
  "legacy_cat__c" : null,
  "AcquisitionCase__c" : null,
  "ReaderType__c" : null,
  "ActivationDate__c" : null,
  "UserCancellationReason__c" : null,
  "OpportunityCloseDate__QT" : null,
  "IPaddress__c" : null,
  "IPCountry__c" : null,
  "PromotionCode__c" : null,
  "OriginalSubscriptionStartDate__c" : null,
  "LegacyContractStartDate__c" : null,
  "CancellationReason__c" : null,
  "billToContact" : null,
  "paymentTerm" : null,
  "invoiceTemplateId" : null,
  "invoiceTemplateName" : null,
  "sequenceSetId" : null,
  "sequenceSetName" : null,
  "soldToContact" : null,
  "isLatestVersion" : true,
  "cancelReason" : null,
  "ratePlans" : [ {
    "id" : "8a129d388962fe000189679374c3429c",
    "lastChangeType" : "Remove",
    "productId" : "2c92a0fe5aacfabe015ad24bf6e15ff6",
    "productName" : "Contributor",
    "productSku" : "ABC-00000028",
    "productRatePlanId" : "2c92a0fc5aacfadd015ad24db4ff5e97",
    "productRatePlanNumber" : null,
    "ratePlanName" : "Monthly Contribution",
    "subscriptionProductFeatures" : [ ],
    "externallyManagedPlanId" : null,
    "subscriptionRatePlanNumber" : null,
    "ratePlanCharges" : [ {
      "id" : "8a129d388962fe000189679374c9429e",
      "originalChargeId" : "2c92a0ff64a5de7f0164acece1b51edc",
      "productRatePlanChargeId" : "2c92a0fc5aacfadd015ad250bf2c6d38",
      "number" : "C-01337228",
      "name" : "Monthly Contribution",
      "productRatePlanChargeNumber" : null,
      "type" : "Recurring",
      "model" : "FlatFee",
      "uom" : null,
      "version" : 6,
      "pricingSummary" : "GBP10",
      "priceChangeOption" : "NoChange",
      "priceIncreasePercentage" : null,
      "currency" : "GBP",
      "price" : 10.000000000,
      "tiers" : null,
      "chargeModelConfiguration" : null,
      "inputArgumentId" : null,
      "includedUnits" : null,
      "overagePrice" : null,
      "discountPercentage" : null,
      "discountAmount" : null,
      "applyDiscountTo" : null,
      "discountLevel" : null,
      "discountClass" : null,
      "discountApplyDetails" : null,
      "billingDay" : "ChargeTriggerDay",
      "listPriceBase" : "Per_Billing_Period",
      "billingPeriod" : "Month",
      "specificBillingPeriod" : null,
      "billingTiming" : "IN_ADVANCE",
      "ratingGroup" : null,
      "billingPeriodAlignment" : "AlignToCharge",
      "quantity" : 1.000000000,
      "smoothingModel" : null,
      "numberOfPeriods" : null,
      "overageCalculationOption" : null,
      "overageUnusedUnitsCreditOption" : null,
      "unusedUnitsCreditRates" : null,
      "usageRecordRatingOption" : null,
      "segment" : 1,
      "effectiveStartDate" : "2018-07-18",
      "effectiveEndDate" : "2023-04-01",
      "processedThroughDate" : "2023-04-01",
      "chargedThroughDate" : "2023-04-01",
      "done" : true,
      "triggerDate" : null,
      "triggerEvent" : "CustomerAcceptance",
      "endDateCondition" : "Subscription_End",
      "upToPeriodsType" : null,
      "upToPeriods" : null,
      "specificEndDate" : null,
      "mrr" : 10.000000000,
      "dmrc" : 0.000000000,
      "tcv" : 564.516129030,
      "dtcv" : -35.483870970,
      "originalOrderDate" : "2018-07-18",
      "amendedByOrderOn" : "2023-04-01",
      "description" : "",
      "HolidayStart__c" : null,
      "HolidayEnd__c" : null,
      "ForceSync__c" : null
    } ]
  }, {
    "id" : "8a129d388962fe000189679374ce42a1",
    "lastChangeType" : "Add",
    "productId" : "8a12865b8219d9b4018221061563643f",
    "productName" : "Supporter Plus",
    "productSku" : "ABC-00000032",
    "productRatePlanId" : "8a12865b8219d9b401822106192b64dc",
    "productRatePlanNumber" : null,
    "ratePlanName" : "Supporter Plus Monthly",
    "subscriptionProductFeatures" : [ ],
    "externallyManagedPlanId" : null,
    "subscriptionRatePlanNumber" : null,
    "ratePlanCharges" : [ {
      "id" : "8a129d388962fe000189679374d142a3",
      "originalChargeId" : "8a12827c87374fca01873b21e74367f8",
      "productRatePlanChargeId" : "8a12865b8219d9b401822106194e64e3",
      "number" : "C-04240692",
      "name" : "Supporter Plus Monthly Charge",
      "productRatePlanChargeNumber" : null,
      "type" : "Recurring",
      "model" : "FlatFee",
      "uom" : null,
      "version" : 2,
      "pricingSummary" : "GBP10",
      "priceChangeOption" : "NoChange",
      "priceIncreasePercentage" : null,
      "currency" : "GBP",
      "price" : 10.000000000,
      "tiers" : null,
      "chargeModelConfiguration" : null,
      "inputArgumentId" : null,
      "includedUnits" : null,
      "overagePrice" : null,
      "discountPercentage" : null,
      "discountAmount" : null,
      "applyDiscountTo" : null,
      "discountLevel" : null,
      "discountClass" : null,
      "discountApplyDetails" : null,
      "billingDay" : "ChargeTriggerDay",
      "listPriceBase" : "Per_Billing_Period",
      "billingPeriod" : "Month",
      "specificBillingPeriod" : null,
      "billingTiming" : "IN_ADVANCE",
      "ratingGroup" : null,
      "billingPeriodAlignment" : "AlignToCharge",
      "quantity" : 1.000000000,
      "smoothingModel" : null,
      "numberOfPeriods" : null,
      "overageCalculationOption" : null,
      "overageUnusedUnitsCreditOption" : null,
      "unusedUnitsCreditRates" : null,
      "usageRecordRatingOption" : null,
      "segment" : 1,
      "effectiveStartDate" : "2023-04-01",
      "effectiveEndDate" : "2024-07-18",
      "processedThroughDate" : "2023-07-01",
      "chargedThroughDate" : "2023-08-01",
      "done" : false,
      "triggerDate" : null,
      "triggerEvent" : "CustomerAcceptance",
      "endDateCondition" : "Subscription_End",
      "upToPeriodsType" : null,
      "upToPeriods" : null,
      "specificEndDate" : null,
      "mrr" : 10.000000000,
      "dmrc" : 0.000000000,
      "tcv" : 155.483870970,
      "dtcv" : 120.000000000,
      "originalOrderDate" : "2023-04-01",
      "amendedByOrderOn" : "2023-07-18",
      "description" : "",
      "HolidayStart__c" : null,
      "HolidayEnd__c" : null,
      "ForceSync__c" : null
    } ]
  } ],
  "orderNumber" : "O-01054409",
  "externallyManagedBy" : null,
  "statusHistory" : [ {
    "startDate" : "2018-07-18",
    "endDate" : "2024-07-18",
    "status" : "Active"
  }, {
    "startDate" : "2024-07-18",
    "endDate" : null,
    "status" : "OutOfTerm"
  } ]
}